demo-output/website/campaign/F3_runs/wedge/M2.0_th15/fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       57160;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       57240;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          120;
        startFace       57320;
    }
    top
    {
        type            patch;
        nFaces          360;
        startFace       57440;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       57800;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          57600;
        startFace       58040;
    }
)

// ************************************************************************* //
